In [9]:
import pandas as pd
df=pd.DataFrame({'id':[1,2,3],'name':['syama','anil','Chandu']})

In [12]:
df.groupby(['id']).min()

      name
id
1    syama
2     anil
3   Chandu

In [6]:
for row,col in df.iterrows():
    print(row,col)

0 id      1
name    A
Name: 0, dtype: object
1 id      2
name    B
Name: 1, dtype: object
2 id      3
name    C
Name: 2, dtype: object

In [7]:
df['id']=df['id'].apply(lambda x:x+2)

In [14]:
df

   id    name
0   1   syama
1   2    anil
2   3  Chandu

In [18]:
df.iloc[1:2,1:]='rohit'

In [19]:
df

   id    name
0   1   syama
1   2   rohit
2   3  Chandu